zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC2/KW43B43ZC2_COMMON.h
/* RX_PACKET_RAM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RX_PACKET_RAM base address */
  #define RX_PACKET_RAM_BASE                       (0x50109000u)
  /** Peripheral RX_PACKET_RAM base address */
  #define RX_PACKET_RAM_BASE_NS                    (0x40109000u)
  /** Peripheral RX_PACKET_RAM base pointer */
  #define RX_PACKET_RAM                            ((RX_PACKET_RAM_Type *)RX_PACKET_RAM_BASE)
  /** Peripheral RX_PACKET_RAM base pointer */
  #define RX_PACKET_RAM_NS                         ((RX_PACKET_RAM_Type *)RX_PACKET_RAM_BASE_NS)
  /** Array initializer of RX_PACKET_RAM peripheral base addresses */
  #define RX_PACKET_RAM_BASE_ADDRS                 { RX_PACKET_RAM_BASE }
  /** Array initializer of RX_PACKET_RAM peripheral base pointers */
  #define RX_PACKET_RAM_BASE_PTRS                  { RX_PACKET_RAM }
  /** Array initializer of RX_PACKET_RAM peripheral base addresses */
  #define RX_PACKET_RAM_BASE_ADDRS_NS              { RX_PACKET_RAM_BASE_NS }
  /** Array initializer of RX_PACKET_RAM peripheral base pointers */
  #define RX_PACKET_RAM_BASE_PTRS_NS               { RX_PACKET_RAM_NS }
#else
  /** Peripheral RX_PACKET_RAM base address */
  #define RX_PACKET_RAM_BASE                       (0x40109000u)
  /** Peripheral RX_PACKET_RAM base pointer */
  #define RX_PACKET_RAM                            ((RX_PACKET_RAM_Type *)RX_PACKET_RAM_BASE)
  /** Array initializer of RX_PACKET_RAM peripheral base addresses */
  #define RX_PACKET_RAM_BASE_ADDRS                 { RX_PACKET_RAM_BASE }
  /** Array initializer of RX_PACKET_RAM peripheral base pointers */
  #define RX_PACKET_RAM_BASE_PTRS                  { RX_PACKET_RAM }
#endif

/* SCG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SCG_0 base address */
  #define SCG_0_BASE                               (0x50182000u)
  /** Peripheral SCG_0 base address */
  #define SCG_0_BASE_NS                            (0x40182000u)
  /** Peripheral SCG_0 base pointer */
  #define SCG_0                                    ((SCG_Type *)SCG_0_BASE)
  /** Peripheral SCG_0 base pointer */
  #define SCG_0_NS                                 ((SCG_Type *)SCG_0_BASE_NS)
  /** Array initializer of SCG peripheral base addresses */
  #define SCG_BASE_ADDRS                           { SCG_0_BASE }
  /** Array initializer of SCG peripheral base pointers */
  #define SCG_BASE_PTRS                            { SCG_0 }
  /** Array initializer of SCG peripheral base addresses */
  #define SCG_BASE_ADDRS_NS                        { SCG_0_BASE_NS }
  /** Array initializer of SCG peripheral base pointers */
  #define SCG_BASE_PTRS_NS                         { SCG_0_NS }
#else
  /** Peripheral SCG_0 base address */
  #define SCG_0_BASE                               (0x40182000u)
  /** Peripheral SCG_0 base pointer */
  #define SCG_0                                    ((SCG_Type *)SCG_0_BASE)
  /** Array initializer of SCG peripheral base addresses */
  #define SCG_BASE_ADDRS                           { SCG_0_BASE }
  /** Array initializer of SCG peripheral base pointers */
  #define SCG_BASE_PTRS                            { SCG_0 }
#endif

/* SECCON - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SECCON base address */
  #define SECCON_BASE                              (0x5019F000u)
  /** Peripheral SECCON base address */
  #define SECCON_BASE_NS                           (0x4019F000u)
  /** Peripheral SECCON base pointer */
  #define SECCON                                   ((SECCON_Type *)SECCON_BASE)
  /** Peripheral SECCON base pointer */
  #define SECCON_NS                                ((SECCON_Type *)SECCON_BASE_NS)
  /** Array initializer of SECCON peripheral base addresses */
  #define SECCON_BASE_ADDRS                        { SECCON_BASE }
  /** Array initializer of SECCON peripheral base pointers */
  #define SECCON_BASE_PTRS                         { SECCON }
  /** Array initializer of SECCON peripheral base addresses */
  #define SECCON_BASE_ADDRS_NS                     { SECCON_BASE_NS }
  /** Array initializer of SECCON peripheral base pointers */
  #define SECCON_BASE_PTRS_NS                      { SECCON_NS }
#else
  /** Peripheral SECCON base address */
  #define SECCON_BASE                              (0x4019F000u)
  /** Peripheral SECCON base pointer */
  #define SECCON                                   ((SECCON_Type *)SECCON_BASE)
  /** Array initializer of SECCON peripheral base addresses */
  #define SECCON_BASE_ADDRS                        { SECCON_BASE }
  /** Array initializer of SECCON peripheral base pointers */
  #define SECCON_BASE_PTRS                         { SECCON }
#endif

/* SEMA42 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SEMA42 base address */
  #define SEMA42_BASE                              (0x50188000u)
  /** Peripheral SEMA42 base address */
  #define SEMA42_BASE_NS                           (0x40188000u)
  /** Peripheral SEMA42 base pointer */
  #define SEMA42                                   ((SEMA42_Type *)SEMA42_BASE)
  /** Peripheral SEMA42 base pointer */
  #define SEMA42_NS                                ((SEMA42_Type *)SEMA42_BASE_NS)
  /** Array initializer of SEMA42 peripheral base addresses */
  #define SEMA42_BASE_ADDRS                        { SEMA42_BASE }
  /** Array initializer of SEMA42 peripheral base pointers */
  #define SEMA42_BASE_PTRS                         { SEMA42 }
  /** Array initializer of SEMA42 peripheral base addresses */
  #define SEMA42_BASE_ADDRS_NS                     { SEMA42_BASE_NS }
  /** Array initializer of SEMA42 peripheral base pointers */
  #define SEMA42_BASE_PTRS_NS                      { SEMA42_NS }
#else
  /** Peripheral SEMA42 base address */
  #define SEMA42_BASE                              (0x40188000u)
  /** Peripheral SEMA42 base pointer */
  #define SEMA42                                   ((SEMA42_Type *)SEMA42_BASE)
  /** Array initializer of SEMA42 peripheral base addresses */
  #define SEMA42_BASE_ADDRS                        { SEMA42_BASE }
  /** Array initializer of SEMA42 peripheral base pointers */
  #define SEMA42_BASE_PTRS                         { SEMA42 }
#endif

