zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC2/KW43B43ZC2_COMMON.h
/* SFA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SFA_0 base address */
  #define SFA_0_BASE                               (0x50198000u)
  /** Peripheral SFA_0 base address */
  #define SFA_0_BASE_NS                            (0x40198000u)
  /** Peripheral SFA_0 base pointer */
  #define SFA_0                                    ((SFA_Type *)SFA_0_BASE)
  /** Peripheral SFA_0 base pointer */
  #define SFA_0_NS                                 ((SFA_Type *)SFA_0_BASE_NS)
  /** Peripheral SFA_1 base address */
  #define SFA_1_BASE                               (0x50022000u)
  /** Peripheral SFA_1 base address */
  #define SFA_1_BASE_NS                            (0x40022000u)
  /** Peripheral SFA_1 base pointer */
  #define SFA_1                                    ((SFA_Type *)SFA_1_BASE)
  /** Peripheral SFA_1 base pointer */
  #define SFA_1_NS                                 ((SFA_Type *)SFA_1_BASE_NS)
  /** Array initializer of SFA peripheral base addresses */
  #define SFA_BASE_ADDRS                           { SFA_0_BASE, SFA_1_BASE }
  /** Array initializer of SFA peripheral base pointers */
  #define SFA_BASE_PTRS                            { SFA_0, SFA_1 }
  /** Array initializer of SFA peripheral base addresses */
  #define SFA_BASE_ADDRS_NS                        { SFA_0_BASE_NS, SFA_1_BASE_NS }
  /** Array initializer of SFA peripheral base pointers */
  #define SFA_BASE_PTRS_NS                         { SFA_0_NS, SFA_1_NS }
#else
  /** Peripheral SFA_0 base address */
  #define SFA_0_BASE                               (0x40198000u)
  /** Peripheral SFA_0 base pointer */
  #define SFA_0                                    ((SFA_Type *)SFA_0_BASE)
  /** Peripheral SFA_1 base address */
  #define SFA_1_BASE                               (0x40022000u)
  /** Peripheral SFA_1 base pointer */
  #define SFA_1                                    ((SFA_Type *)SFA_1_BASE)
  /** Array initializer of SFA peripheral base addresses */
  #define SFA_BASE_ADDRS                           { SFA_0_BASE, SFA_1_BASE }
  /** Array initializer of SFA peripheral base pointers */
  #define SFA_BASE_PTRS                            { SFA_0, SFA_1 }
#endif

/* SGI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SGI_0 base address */
  #define SGI_0_BASE                               (0x5003A000u)
  /** Peripheral SGI_0 base address */
  #define SGI_0_BASE_NS                            (0x4003A000u)
  /** Peripheral SGI_0 base pointer */
  #define SGI_0                                    ((SGI_Type *)SGI_0_BASE)
  /** Peripheral SGI_0 base pointer */
  #define SGI_0_NS                                 ((SGI_Type *)SGI_0_BASE_NS)
  /** Array initializer of SGI peripheral base addresses */
  #define SGI_BASE_ADDRS                           { SGI_0_BASE }
  /** Array initializer of SGI peripheral base pointers */
  #define SGI_BASE_PTRS                            { SGI_0 }
  /** Array initializer of SGI peripheral base addresses */
  #define SGI_BASE_ADDRS_NS                        { SGI_0_BASE_NS }
  /** Array initializer of SGI peripheral base pointers */
  #define SGI_BASE_PTRS_NS                         { SGI_0_NS }
#else
  /** Peripheral SGI_0 base address */
  #define SGI_0_BASE                               (0x4003A000u)
  /** Peripheral SGI_0 base pointer */
  #define SGI_0                                    ((SGI_Type *)SGI_0_BASE)
  /** Array initializer of SGI peripheral base addresses */
  #define SGI_BASE_ADDRS                           { SGI_0_BASE }
  /** Array initializer of SGI peripheral base pointers */
  #define SGI_BASE_PTRS                            { SGI_0 }
#endif

/* SPC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SPC_0 base address */
  #define SPC_0_BASE                               (0x50180000u)
  /** Peripheral SPC_0 base address */
  #define SPC_0_BASE_NS                            (0x40180000u)
  /** Peripheral SPC_0 base pointer */
  #define SPC_0                                    ((SPC_Type *)SPC_0_BASE)
  /** Peripheral SPC_0 base pointer */
  #define SPC_0_NS                                 ((SPC_Type *)SPC_0_BASE_NS)
  /** Array initializer of SPC peripheral base addresses */
  #define SPC_BASE_ADDRS                           { SPC_0_BASE }
  /** Array initializer of SPC peripheral base pointers */
  #define SPC_BASE_PTRS                            { SPC_0 }
  /** Array initializer of SPC peripheral base addresses */
  #define SPC_BASE_ADDRS_NS                        { SPC_0_BASE_NS }
  /** Array initializer of SPC peripheral base pointers */
  #define SPC_BASE_PTRS_NS                         { SPC_0_NS }
#else
  /** Peripheral SPC_0 base address */
  #define SPC_0_BASE                               (0x40180000u)
  /** Peripheral SPC_0 base pointer */
  #define SPC_0                                    ((SPC_Type *)SPC_0_BASE)
  /** Array initializer of SPC peripheral base addresses */
  #define SPC_BASE_ADDRS                           { SPC_0_BASE }
  /** Array initializer of SPC peripheral base pointers */
  #define SPC_BASE_PTRS                            { SPC_0 }
#endif

/* SYSCON - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON base address */
  #define SYSCON_BASE                              (0x5019E000u)
  /** Peripheral SYSCON base address */
  #define SYSCON_BASE_NS                           (0x4019E000u)
  /** Peripheral SYSCON base pointer */
  #define SYSCON                                   ((SYSCON_Type *)SYSCON_BASE)
  /** Peripheral SYSCON base pointer */
  #define SYSCON_NS                                ((SYSCON_Type *)SYSCON_BASE_NS)
  /** Array initializer of SYSCON peripheral base addresses */
  #define SYSCON_BASE_ADDRS                        { SYSCON_BASE }
  /** Array initializer of SYSCON peripheral base pointers */
  #define SYSCON_BASE_PTRS                         { SYSCON }
  /** Array initializer of SYSCON peripheral base addresses */
  #define SYSCON_BASE_ADDRS_NS                     { SYSCON_BASE_NS }
  /** Array initializer of SYSCON peripheral base pointers */
  #define SYSCON_BASE_PTRS_NS                      { SYSCON_NS }
#else
  /** Peripheral SYSCON base address */
  #define SYSCON_BASE                              (0x4019E000u)
  /** Peripheral SYSCON base pointer */
  #define SYSCON                                   ((SYSCON_Type *)SYSCON_BASE)
  /** Array initializer of SYSCON peripheral base addresses */
  #define SYSCON_BASE_ADDRS                        { SYSCON_BASE }
  /** Array initializer of SYSCON peripheral base pointers */
  #define SYSCON_BASE_PTRS                         { SYSCON }
#endif

/* SYSPM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSPM base address */
  #define SYSPM_BASE                               (0x50014000u)
  /** Peripheral SYSPM base address */
  #define SYSPM_BASE_NS                            (0x40014000u)
  /** Peripheral SYSPM base pointer */
  #define SYSPM                                    ((SYSPM_Type *)SYSPM_BASE)
  /** Peripheral SYSPM base pointer */
  #define SYSPM_NS                                 ((SYSPM_Type *)SYSPM_BASE_NS)
  /** Array initializer of SYSPM peripheral base addresses */
  #define SYSPM_BASE_ADDRS                         { SYSPM_BASE }
  /** Array initializer of SYSPM peripheral base pointers */
  #define SYSPM_BASE_PTRS                          { SYSPM }
  /** Array initializer of SYSPM peripheral base addresses */
  #define SYSPM_BASE_ADDRS_NS                      { SYSPM_BASE_NS }
  /** Array initializer of SYSPM peripheral base pointers */
  #define SYSPM_BASE_PTRS_NS                       { SYSPM_NS }
#else
  /** Peripheral SYSPM base address */
  #define SYSPM_BASE                               (0x40014000u)
  /** Peripheral SYSPM base pointer */
  #define SYSPM                                    ((SYSPM_Type *)SYSPM_BASE)
  /** Array initializer of SYSPM peripheral base addresses */
  #define SYSPM_BASE_ADDRS                         { SYSPM_BASE }
  /** Array initializer of SYSPM peripheral base pointers */
  #define SYSPM_BASE_PTRS                          { SYSPM }
#endif

/* TPM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TPM_0 base address */
  #define TPM_0_BASE                               (0x5001E000u)
  /** Peripheral TPM_0 base address */
  #define TPM_0_BASE_NS                            (0x4001E000u)
  /** Peripheral TPM_0 base pointer */
  #define TPM_0                                    ((TPM_Type *)TPM_0_BASE)
  /** Peripheral TPM_0 base pointer */
  #define TPM_0_NS                                 ((TPM_Type *)TPM_0_BASE_NS)
  /** Peripheral TPM_1 base address */
  #define TPM_1_BASE                               (0x50187000u)
  /** Peripheral TPM_1 base address */
  #define TPM_1_BASE_NS                            (0x40187000u)
  /** Peripheral TPM_1 base pointer */
  #define TPM_1                                    ((TPM_Type *)TPM_1_BASE)
  /** Peripheral TPM_1 base pointer */
  #define TPM_1_NS                                 ((TPM_Type *)TPM_1_BASE_NS)
  /** Peripheral TPM_2 base address */
  #define TPM_2_BASE                               (0x50202000u)
  /** Peripheral TPM_2 base address */
  #define TPM_2_BASE_NS                            (0x40202000u)
  /** Peripheral TPM_2 base pointer */
  #define TPM_2                                    ((TPM_Type *)TPM_2_BASE)
  /** Peripheral TPM_2 base pointer */
  #define TPM_2_NS                                 ((TPM_Type *)TPM_2_BASE_NS)
  /** Peripheral TPM_3 base address */
  #define TPM_3_BASE                               (0x5001F000u)
  /** Peripheral TPM_3 base address */
  #define TPM_3_BASE_NS                            (0x4001F000u)
  /** Peripheral TPM_3 base pointer */
  #define TPM_3                                    ((TPM_Type *)TPM_3_BASE)
  /** Peripheral TPM_3 base pointer */
  #define TPM_3_NS                                 ((TPM_Type *)TPM_3_BASE_NS)
  /** Peripheral TPM_4 base address */
  #define TPM_4_BASE                               (0x50020000u)
  /** Peripheral TPM_4 base address */
  #define TPM_4_BASE_NS                            (0x40020000u)
  /** Peripheral TPM_4 base pointer */
  #define TPM_4                                    ((TPM_Type *)TPM_4_BASE)
  /** Peripheral TPM_4 base pointer */
  #define TPM_4_NS                                 ((TPM_Type *)TPM_4_BASE_NS)
  /** Array initializer of TPM peripheral base addresses */
  #define TPM_BASE_ADDRS                           { TPM_0_BASE, TPM_1_BASE, TPM_2_BASE, TPM_3_BASE, TPM_4_BASE }
  /** Array initializer of TPM peripheral base pointers */
  #define TPM_BASE_PTRS                            { TPM_0, TPM_1, TPM_2, TPM_3, TPM_4 }
  /** Array initializer of TPM peripheral base addresses */
  #define TPM_BASE_ADDRS_NS                        { TPM_0_BASE_NS, TPM_1_BASE_NS, TPM_2_BASE_NS, TPM_3_BASE_NS, TPM_4_BASE_NS }
  /** Array initializer of TPM peripheral base pointers */
  #define TPM_BASE_PTRS_NS                         { TPM_0_NS, TPM_1_NS, TPM_2_NS, TPM_3_NS, TPM_4_NS }
#else
  /** Peripheral TPM_0 base address */
  #define TPM_0_BASE                               (0x4001E000u)
  /** Peripheral TPM_0 base pointer */
  #define TPM_0                                    ((TPM_Type *)TPM_0_BASE)
  /** Peripheral TPM_1 base address */
  #define TPM_1_BASE                               (0x40187000u)
  /** Peripheral TPM_1 base pointer */
  #define TPM_1                                    ((TPM_Type *)TPM_1_BASE)
  /** Peripheral TPM_2 base address */
  #define TPM_2_BASE                               (0x40202000u)
  /** Peripheral TPM_2 base pointer */
  #define TPM_2                                    ((TPM_Type *)TPM_2_BASE)
  /** Peripheral TPM_3 base address */
  #define TPM_3_BASE                               (0x4001F000u)
  /** Peripheral TPM_3 base pointer */
  #define TPM_3                                    ((TPM_Type *)TPM_3_BASE)
  /** Peripheral TPM_4 base address */
  #define TPM_4_BASE                               (0x40020000u)
  /** Peripheral TPM_4 base pointer */
  #define TPM_4                                    ((TPM_Type *)TPM_4_BASE)
  /** Array initializer of TPM peripheral base addresses */
  #define TPM_BASE_ADDRS                           { TPM_0_BASE, TPM_1_BASE, TPM_2_BASE, TPM_3_BASE, TPM_4_BASE }
  /** Array initializer of TPM peripheral base pointers */
  #define TPM_BASE_PTRS                            { TPM_0, TPM_1, TPM_2, TPM_3, TPM_4 }
#endif
/** Interrupt vectors for the TPM peripheral type */
#define TPM_IRQS                                 { TPM_0_IRQn, TPM_1_IRQn, TPM_2_IRQn, TPM_3_IRQn, TPM_4_IRQn }

/* TRDC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TRDC_0_MGR base address */
  #define TRDC_0_MGR_BASE                          (0x5018C000u)
  /** Peripheral TRDC_0_MGR base address */
  #define TRDC_0_MGR_BASE_NS                       (0x4018C000u)
  /** Peripheral TRDC_0_MGR base pointer */
  #define TRDC_0_MGR                               ((TRDC_Type *)TRDC_0_MGR_BASE)
  /** Peripheral TRDC_0_MGR base pointer */
  #define TRDC_0_MGR_NS                            ((TRDC_Type *)TRDC_0_MGR_BASE_NS)
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS                          { TRDC_0_MGR_BASE }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS                           { TRDC_0_MGR }
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS_NS                       { TRDC_0_MGR_BASE_NS }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS_NS                        { TRDC_0_MGR_NS }
#else
  /** Peripheral TRDC_0_MGR base address */
  #define TRDC_0_MGR_BASE                          (0x4018C000u)
  /** Peripheral TRDC_0_MGR base pointer */
  #define TRDC_0_MGR                               ((TRDC_Type *)TRDC_0_MGR_BASE)
  /** Array initializer of TRDC peripheral base addresses */
  #define TRDC_BASE_ADDRS                          { TRDC_0_MGR_BASE }
  /** Array initializer of TRDC peripheral base pointers */
  #define TRDC_BASE_PTRS                           { TRDC_0_MGR }
#endif

/* TRGMUX - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TRGMUX_0 base address */
  #define TRGMUX_0_BASE                            (0x50015000u)
  /** Peripheral TRGMUX_0 base address */
  #define TRGMUX_0_BASE_NS                         (0x40015000u)
  /** Peripheral TRGMUX_0 base pointer */
  #define TRGMUX_0                                 ((TRGMUX_Type *)TRGMUX_0_BASE)
  /** Peripheral TRGMUX_0 base pointer */
  #define TRGMUX_0_NS                              ((TRGMUX_Type *)TRGMUX_0_BASE_NS)
  /** Array initializer of TRGMUX peripheral base addresses */
  #define TRGMUX_BASE_ADDRS                        { TRGMUX_0_BASE }
  /** Array initializer of TRGMUX peripheral base pointers */
  #define TRGMUX_BASE_PTRS                         { TRGMUX_0 }
  /** Array initializer of TRGMUX peripheral base addresses */
  #define TRGMUX_BASE_ADDRS_NS                     { TRGMUX_0_BASE_NS }
  /** Array initializer of TRGMUX peripheral base pointers */
  #define TRGMUX_BASE_PTRS_NS                      { TRGMUX_0_NS }
#else
  /** Peripheral TRGMUX_0 base address */
  #define TRGMUX_0_BASE                            (0x40015000u)
  /** Peripheral TRGMUX_0 base pointer */
  #define TRGMUX_0                                 ((TRGMUX_Type *)TRGMUX_0_BASE)
  /** Array initializer of TRGMUX peripheral base addresses */
  #define TRGMUX_BASE_ADDRS                        { TRGMUX_0_BASE }
  /** Array initializer of TRGMUX peripheral base pointers */
  #define TRGMUX_BASE_PTRS                         { TRGMUX_0 }
#endif

/* TRNG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TRNG_0 base address */
  #define TRNG_0_BASE                              (0x5003C000u)
  /** Peripheral TRNG_0 base address */
  #define TRNG_0_BASE_NS                           (0x4003C000u)
  /** Peripheral TRNG_0 base pointer */
  #define TRNG_0                                   ((TRNG_Type *)TRNG_0_BASE)
  /** Peripheral TRNG_0 base pointer */
  #define TRNG_0_NS                                ((TRNG_Type *)TRNG_0_BASE_NS)
  /** Array initializer of TRNG peripheral base addresses */
  #define TRNG_BASE_ADDRS                          { TRNG_0_BASE }
  /** Array initializer of TRNG peripheral base pointers */
  #define TRNG_BASE_PTRS                           { TRNG_0 }
  /** Array initializer of TRNG peripheral base addresses */
  #define TRNG_BASE_ADDRS_NS                       { TRNG_0_BASE_NS }
  /** Array initializer of TRNG peripheral base pointers */
  #define TRNG_BASE_PTRS_NS                        { TRNG_0_NS }
#else
  /** Peripheral TRNG_0 base address */
  #define TRNG_0_BASE                              (0x4003C000u)
  /** Peripheral TRNG_0 base pointer */
  #define TRNG_0                                   ((TRNG_Type *)TRNG_0_BASE)
  /** Array initializer of TRNG peripheral base addresses */
  #define TRNG_BASE_ADDRS                          { TRNG_0_BASE }
  /** Array initializer of TRNG peripheral base pointers */
  #define TRNG_BASE_PTRS                           { TRNG_0 }
#endif

/* TSTMR - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TIMESTAMP0 base address */
  #define TIMESTAMP0_BASE                          (0x50199000u)
  /** Peripheral TIMESTAMP0 base address */
  #define TIMESTAMP0_BASE_NS                       (0x40199000u)
  /** Peripheral TIMESTAMP0 base pointer */
  #define TIMESTAMP0                               ((TSTMR_Type *)TIMESTAMP0_BASE)
  /** Peripheral TIMESTAMP0 base pointer */
  #define TIMESTAMP0_NS                            ((TSTMR_Type *)TIMESTAMP0_BASE_NS)
  /** Peripheral TIMESTAMP1_0 base address */
  #define TIMESTAMP1_0_BASE                        (0x5019A000u)
  /** Peripheral TIMESTAMP1_0 base address */
  #define TIMESTAMP1_0_BASE_NS                     (0x4019A000u)
  /** Peripheral TIMESTAMP1_0 base pointer */
  #define TIMESTAMP1_0                             ((TSTMR_Type *)TIMESTAMP1_0_BASE)
  /** Peripheral TIMESTAMP1_0 base pointer */
  #define TIMESTAMP1_0_NS                          ((TSTMR_Type *)TIMESTAMP1_0_BASE_NS)
  /** Peripheral TIMESTAMP1_1 base address */
  #define TIMESTAMP1_1_BASE                        (0x5019B000u)
  /** Peripheral TIMESTAMP1_1 base address */
  #define TIMESTAMP1_1_BASE_NS                     (0x4019B000u)
  /** Peripheral TIMESTAMP1_1 base pointer */
  #define TIMESTAMP1_1                             ((TSTMR_Type *)TIMESTAMP1_1_BASE)
  /** Peripheral TIMESTAMP1_1 base pointer */
  #define TIMESTAMP1_1_NS                          ((TSTMR_Type *)TIMESTAMP1_1_BASE_NS)
  /** Array initializer of TSTMR peripheral base addresses */
  #define TSTMR_BASE_ADDRS                         { TIMESTAMP0_BASE, TIMESTAMP1_0_BASE, TIMESTAMP1_1_BASE }
  /** Array initializer of TSTMR peripheral base pointers */
  #define TSTMR_BASE_PTRS                          { TIMESTAMP0, TIMESTAMP1_0, TIMESTAMP1_1 }
  /** Array initializer of TSTMR peripheral base addresses */
  #define TSTMR_BASE_ADDRS_NS                      { TIMESTAMP0_BASE_NS, TIMESTAMP1_0_BASE_NS, TIMESTAMP1_1_BASE_NS }
  /** Array initializer of TSTMR peripheral base pointers */
  #define TSTMR_BASE_PTRS_NS                       { TIMESTAMP0_NS, TIMESTAMP1_0_NS, TIMESTAMP1_1_NS }
#else
  /** Peripheral TIMESTAMP0 base address */
  #define TIMESTAMP0_BASE                          (0x40199000u)
  /** Peripheral TIMESTAMP0 base pointer */
  #define TIMESTAMP0                               ((TSTMR_Type *)TIMESTAMP0_BASE)
  /** Peripheral TIMESTAMP1_0 base address */
  #define TIMESTAMP1_0_BASE                        (0x4019A000u)
  /** Peripheral TIMESTAMP1_0 base pointer */
  #define TIMESTAMP1_0                             ((TSTMR_Type *)TIMESTAMP1_0_BASE)
  /** Peripheral TIMESTAMP1_1 base address */
  #define TIMESTAMP1_1_BASE                        (0x4019B000u)
  /** Peripheral TIMESTAMP1_1 base pointer */
  #define TIMESTAMP1_1                             ((TSTMR_Type *)TIMESTAMP1_1_BASE)
  /** Array initializer of TSTMR peripheral base addresses */
  #define TSTMR_BASE_ADDRS                         { TIMESTAMP0_BASE, TIMESTAMP1_0_BASE, TIMESTAMP1_1_BASE }
  /** Array initializer of TSTMR peripheral base pointers */
  #define TSTMR_BASE_PTRS                          { TIMESTAMP0, TIMESTAMP1_0, TIMESTAMP1_1 }
#endif
/* Extra definition */
#define TSTMR_CLOCK_FREQUENCY_MHZ                (1U)


/* TX_PACKET_RAM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral TX_PACKET_RAM base address */
  #define TX_PACKET_RAM_BASE                       (0x50108000u)
  /** Peripheral TX_PACKET_RAM base address */
  #define TX_PACKET_RAM_BASE_NS                    (0x40108000u)
  /** Peripheral TX_PACKET_RAM base pointer */
  #define TX_PACKET_RAM                            ((TX_PACKET_RAM_Type *)TX_PACKET_RAM_BASE)
  /** Peripheral TX_PACKET_RAM base pointer */
  #define TX_PACKET_RAM_NS                         ((TX_PACKET_RAM_Type *)TX_PACKET_RAM_BASE_NS)
  /** Array initializer of TX_PACKET_RAM peripheral base addresses */
  #define TX_PACKET_RAM_BASE_ADDRS                 { TX_PACKET_RAM_BASE }
  /** Array initializer of TX_PACKET_RAM peripheral base pointers */
  #define TX_PACKET_RAM_BASE_PTRS                  { TX_PACKET_RAM }
  /** Array initializer of TX_PACKET_RAM peripheral base addresses */
  #define TX_PACKET_RAM_BASE_ADDRS_NS              { TX_PACKET_RAM_BASE_NS }
  /** Array initializer of TX_PACKET_RAM peripheral base pointers */
  #define TX_PACKET_RAM_BASE_PTRS_NS               { TX_PACKET_RAM_NS }
#else
  /** Peripheral TX_PACKET_RAM base address */
  #define TX_PACKET_RAM_BASE                       (0x40108000u)
  /** Peripheral TX_PACKET_RAM base pointer */
  #define TX_PACKET_RAM                            ((TX_PACKET_RAM_Type *)TX_PACKET_RAM_BASE)
  /** Array initializer of TX_PACKET_RAM peripheral base addresses */
  #define TX_PACKET_RAM_BASE_ADDRS                 { TX_PACKET_RAM_BASE }
  /** Array initializer of TX_PACKET_RAM peripheral base pointers */
  #define TX_PACKET_RAM_BASE_PTRS                  { TX_PACKET_RAM }
#endif

